import { Link, Outlet } from "react-router-dom"
import "./Poets.css"
import { useState } from "react";

export function Poet(props)
{
    return <section id="sectionPoet">
        <div>
            <div id="nameImgPoet">
                <img src={props.img} alt="imgPoet"></img>
                <p>{props.fullName}</p>
            </div>
            <p id="infoPoet">{props.info}</p>
        </div>
    </section>
}

export function IndexPage()
{
    const [display, setDisplay] = useState({fontSize: "0px"})
    let poets = AllPoets();
    function mouseEnter()
    {
        setDisplay({fontSize: "20px"})
    }
    function mouseLeave()
    {
        setDisplay({fontSize: "0px"})
    }

    return <>
        <nav>
            <ul id="listPoets" onMouseEnter={mouseEnter} onMouseLeave={mouseLeave}>
                <p>Поети</p>
                {poets.map(poet => (
                    <li id="poet" style={display}>
                        <Link to={`/${poet.path}`}>{poet.fullName}</Link>
                    </li>
                ))}
            </ul>
        </nav>

        <Outlet></Outlet>
    </> 
}


function PoetObj(fullName, img, info, path)
{
  return {
    fullName:fullName,
    img:img,
    info:info,
    path:path,  
    }
}
export function AllPoets()
{
    return [
        PoetObj("Тарас Шевченко", "https://kpi.ua/files/images/shevchenko.jpg", `Тарас Шевченко народився 9 березня 1814 року в селі Моринці Пединівської волості Звенигородського повіту Київської губернії. Був третьою дитиною селян-кріпаків Григорія Івановича Шевченка і Катерини Якимівни після сестри Катерини (1804 — близько 1848) та брата Микити (1811 — близько 1870).
За родинними переказами, Тарасові діди й прадіди з батьківського боку походили від козака Андрія, який на початку XVIII століття прийшов із Запорізької Січі. Дід по матері Бойко Яким Омелянович за однією з версій був виходцем з Прикарпаття, сином опришка Івана Бойчука.
1816 року сім'я Шевченків переїхала до села Кирилівки Звенигородського повіту, звідки походив Григорій Іванович. Дитячі роки Тараса пройшли в цьому селі. 1816 року народилася Тарасова сестра Ярина, 1819 року — сестра Марія, а 1821 року народився Тарасів брат Йосип.
Восени 1822 року Тарас Шевченко почав учитися грамоти в дяка Совгиря. Тоді ж ознайомився з творами Григорія Сковороди.
10 лютого 1823 року його старша сестра Катерина вийшла заміж за Антона Красицького — селянина із Зеленої Діброви, а 1 вересня 1823 року від тяжкої праці 
й злиднів померла мати Катерина.`, "taras_shevchenko"),
        
        PoetObj("Леся Українка", "https://dovidka.biz.ua/wp-content/uploads/2014/10/lesya-ukra-nka-b-ograf-ya-skorocheno-tablitsya.jpg", `Леся Українка (справжнє ім’я — Лариса Петрівна Косач) народилася 25 лютого 1871 року в місті Новограді-Волинському на Волині (тепер — Житомирська область). Вона була другою дитиною в родині. Її батько — Петро Антонович Косач — був освіченим землевласником, мати — письменниця і громадська діячка Олена Пчілка (справжнє ім’я — Ольга Косач).
Родина Косачів була інтелігентною і патріотично налаштованою, у їхньому домі панувала українська мова та культура. З дитинства Леся виявляла здібності до мов, літератури та музики. Вона вільно володіла кількома європейськими мовами.
У 1881 році Леся важко захворіла на туберкульоз кісток, що вплинуло на все її подальше життя. Через хворобу вона не могла відвідувати школу, тому здобувала освіту вдома під керівництвом матері та приватних учителів.
Перші поетичні твори Леся почала писати у ранньому віці. У 13 років з’явився її перший вірш «Надія», а у 1884 році вона вперше підписалася псевдонімом «Леся Українка».
Протягом життя Леся активно займалася літературною, публіцистичною та перекладацькою діяльністю. Вона писала вірші, поеми, драматичні твори, перекладала класичні тексти з багатьох мов.
Померла Леся Українка 1 серпня 1913 року в грузинському місті Сурамі, де перебувала на лікуванні. Похована в Києві на Байковому кладовищі.`, "lesya_ukrainka"),
            
        PoetObj("Іван Франко", "https://fastnews.com.ua/wp-content/uploads/2024/04/ivan-franko.jpg", `Іван Франко народився 27 серпня 1856 року в селі Нагуєвичі на Львівщині (тоді — Австро-Угорська імперія). Його батько, Яків Франко, був сільським ковалем, мати — Марія Кульчицька — походила з родини дрібної шляхти.
У 1864 році Іван почав навчання в сільській школі, згодом у Дрогобицькій гімназії. У 1875 році вступив до Львівського університету на філософський факультет, де почав активно займатися літературною і громадською діяльністю. Пізніше навчався також у Чернівецькому та Віденському університетах.
Франко писав вірші, прозу, драматичні твори, наукові праці, статті з філософії, історії, соціології, економіки. Він став одним із засновників українського національного руху в Галичині. Був активним публіцистом, перекладачем, журналістом, критиком.
У 1880-х роках кілька разів заарештовувався за політичну діяльність. Він виступав за права українців, розвиток мови, освіти, культури.
Одним із найвідоміших творів Франка є поема «Мойсей», в якій розкривається тема лідера і народу. Також широко відомі його твори «Захар Беркут», «Борислав сміється», «Каменярі».
Помер Іван Франко 28 травня 1916 року у Львові. Похований на Личаківському цвинтарі.`, "ivan_franko")
            ]
}